performance.yml
config:
  target: https://api.todoist.com
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Phase 1"
    - duration: 120
      arrivalRate: 20
      name: "Phase 2" 
    - duration: 80
      arrivalRate: 8
      name: "Phase 3" 
  defaults:
    headers:
      Authorization: Bearer {{ $processEnvironment.TOKEN }}
      Content-type: application/json
scenarios:
  - flow:
      - get:
          url: "/rest/v1/projects"
      - post:
          url: "/rest/v1/projects"
          json:
           name: "TestGabby"
          capture:
           json: "$.id" 
           as: "id"
      - log: "Current id is {{ id }}"
      - get:
          url: "/rest/v1/projects/projects/{{ id }}"
      - post:
          url: "/rest/v1/projects/projects/{{ id }}"
          json:
           name: "WizelineTest"
      - delete:
          url: "/rest/v1/projects/projects/{{ id }}"
      - get:
          url: "/rest/v1/tasks/projects/projects/{{ id }}"
      - put: 
          url: "/rest/v1/tasks/projects/projects/{{ id }}"
          json:
          name: "GabbyTest"
      - post: 
          url: "/rest/v1/tasks/projects/projects/{{ id }}/reopen"
          json:
          name: "reopen"